USE PD_311_DDL;
GO

INSERT 
Disciplines
(discipline_id, discipline_name, number_of_lessons, report_type)
VALUES
(1, N'Процедурное программирование на языке C++',						96, 1),
(2, N'Объектно-ориентированное программирование на языке C++',			76, 1),
(3, N'UML и паттерны проектирования',									18, 1),
(4, N'Платформа .NET и язык программирования C#',						32, 2),
(5, N'Разработка Windows приложений на языке C++',						18, 1),
(6, N'Разработка Windows приложения на языке C#',						18, 1),
(7, N'Теория Баз Данных и программирование MS_SQL Server',				32, 1),
(9, N'Технология доступа к данным ADO.NET',								24, 1),
(10, N'Разработка Web-приложений с использованием технологии ASP.NET',	48, 1),
(11, N'Основы программирования на языке Java',							96, 1),
(12, N'Разработка Back-End приложений на языке Java',					50, 1),
(13, N'HTML/CSS',														24, 1),
(14, N'Программирование на языке JavaScript',							24, 1),
(15, N'Теория Баз Данных и программирование MуSQL Server',				32, 1),
(16, N'BackEnd разработка на языке PHP',								24, 1),
(17, N'FrontEnd разработка с использованием NodeJS',					24, 1),
(18, N'BackEnd разработка с использование ReactJS',						24, 1),
(19, N'Adobe Photoshop',												32, 1),
(20, N'Adobe Illustrator',												32, 1),
(21, N'Adobe Premiere Pro',												32, 1),
(22, N'Adobe AfterEffects',												48, 1),
(23, N'AutoCAD',														32, 1),
(24, N'3DS Max',														44, 1),
(25, N'Maya',															77, 1),
(26, N'Blender',														32, 1),
(27, N'Базовые технологии локальных сетей',								24, 2),
(28, N'Маршрутизация в IP-сетях',										44, 1),
(29, N'Протоколы прикладного уровня',									44, 1),
(30, N'Hardware-PC',													32, 1),
(31, N'Администрирование Window XP/7/8/10/11', 							32, 1),
(32, N'Администрирование Window Server',								32, 1),
(33, N'Администрирование UNIX',											32, 1),
(34, N'Game Development на движке UnrealEngine',						44, 1),
(35, N'Game Development на движке Cryengine',							77, 1),
(36, N'Android Development',											32, 1)